GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808_gps.c
	double	part3 = sin( latFromRad ) * sin( latToRad ) + cos( latFromRad ) * cos( latToRad ) * cos( lngDiff );
	//double centralAngle = atan2( sqrt(part1 + part2) / part3 );
	double	centralAngle = atan( sqrt( part1 + part2 ) / part3 );
	return 6371.01 * 1000.0 * centralAngle; //Return Distance in meter
}

#endif

#define DF_POSTREPORT_START		0x00298000
#define DF_POSTREPORT_END		0x002FC000
#define DF_POSTREPORT_SECTORS	100

/*只能做1->0的写入*/
#define ATTR_NONET_NOREPORT 0xFF    /*未登网 未上报 */
#define ATTR_ONNET_NOREPORT 0xFE    /*已登网 上报失败 */
#define ATTR_REPORTED		0xFC    /*已上报 11111100*/

typedef __packed struct
{
	uint32_t	mn;
	uint32_t	id;
	uint8_t		attr;
	uint8_t		unused;
	uint16_t	len;
	//uint32_t	msg_id;		/*上报的消息头0x0200*/
}GPS_REPORT_HEAD;

typedef struct
{
	uint32_t	addr;
	uint32_t	id;
	uint8_t		attr;
	uint16_t	len;
}REPORT_INFO;

REPORT_INFO		report_curr = { 0, 0, 0, 0 };

static uint32_t report_addr[20];            /*上报记录的地址*/
static uint8_t	report_get_count	= 0;    /*获取的未上报记录数*/
static uint32_t report_get_addr		= 0;    /*获取的未上报记录最小id的地址*/

static uint16_t report_count = 0;           /*还没有上报的记录数*/


/*
   上报信息收到响应,通用应答 0x8001
 */
static JT808_MSG_STATE jt808_report_response( JT808_TX_NODEDATA * nodedata, uint8_t *pmsg )
{
	uint8_t			* msg = pmsg + 12;
	uint16_t		ack_id;
	uint16_t		ack_seq;
	uint8_t			ack_res;
	uint32_t		addr;

	GPS_REPORT_HEAD head;
	uint32_t		i;

	ack_seq = ( msg[0] << 8 ) | msg[1];
	ack_id	= ( msg[2] << 8 ) | msg[3];
	ack_res = *( msg + 4 );
	rt_kprintf( "\n%d>ACK %04x:%04x:%d", rt_tick_get( ), ack_id, ack_seq, ack_res );
	if( ack_res == 0 )
	{
		rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 5 );
		if( ack_id == 0x0200 )              /*在线上报*/
		{
			addr = *( (uint32_t*)&( nodedata->user_para ) );
			sst25_read( addr, (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
			if( head.mn == 0x474E5353 )
			{
				head.attr &= 0x7F;          /*最高位置0*/
				sst25_write_through( addr, (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
			}
			nodedata->user_para = RT_NULL;  /*传递进来只是指明flash地址，并不是要释放*/
		}
		if( ack_id == 0x0704 )              /*批量上报*/
		{
			for( i = 0; i < report_get_count; i++ )
			{
				sst25_read( report_addr[i], (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
				if( head.mn == 0x474E5353 )
				{
					head.attr &= 0x7F;      /*最高位置0*/
					sst25_write_through( report_addr[i], (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
				}
				if( report_count )
				{
					report_count--;
				}
			}
		}
		rt_sem_release( &sem_dataflash );
	}

	return ACK_OK;
}

/*
   消息发送超时,保存数据为补报
 */
static JT808_MSG_STATE jt808_report_timeout( JT808_TX_NODEDATA * nodedata )
{
	nodedata->user_para = RT_NULL; /*传递进来只是指明flash地址，并不是要释放*/
	return ACK_TIMEOUT;
}

/*
   查找最后一个写入的位置
   查找未上报记录最小id的位置
 */
void jt808_report_init( void )
{
	uint32_t		addr;
	GPS_REPORT_HEAD head;
	uint32_t		read_id = 0xFFFFFFFF;
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 5 );

	report_count		= 0; /*重新查找*/
	report_curr.addr	= 0;
	report_curr.id		= 0;
	report_curr.len		= 0;

	memset( report_addr, 0, sizeof( report_addr ) );

	for( addr = DF_POSTREPORT_START; addr < DF_POSTREPORT_END; addr += 64 )
	{
		sst25_read( addr, (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
		if( head.mn == 0x474E5353 )         /*有效记录*/
		{
			if( head.id >= report_curr.id ) /*查找最近记录,当前写入的位置*/
			{
				report_curr.id		= head.id;
				report_curr.addr	= addr; /*当前记录的地址*/
				report_curr.len		= head.len;
			}
			if( head.attr > 0x7F )          /*bit7=1 还没有发送*/
			{
				report_count++;             /*统计未上报记录数*/
				if( read_id > head.id )     /*要找到最小id的地址*/
				{
					report_get_addr = addr;
					read_id			= head.id;
				}
			}
		}
	}
	rt_sem_release( &sem_dataflash );
	rt_kprintf( "\n%d>(%d)写入位置:%x id=%d 读出位置:%x id=%d",
	            rt_tick_get( ),
	            report_count,
	            report_curr.addr,
	            report_curr.id,
	            report_get_addr,
	            read_id );
}

/*补报数据保存*/
void jt808_report_put( uint8_t* pinfo, uint16_t len )
{
	GPS_REPORT_HEAD head;

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 5 );

	if( report_curr.addr )                  /*当先的上报地址*/
	{
		report_curr.addr	+= ( 12 + report_curr.len + 63 );
		report_curr.addr	&= 0xFFFFFFC0;  /*指向下一个地址*/
	}else                                   /*还没有记录*/
	{
		report_curr.addr = DF_POSTREPORT_START;
	}

	if( report_curr.addr >= DF_POSTREPORT_END )
	{
		report_curr.addr = DF_POSTREPORT_START;
	}
	if( ( report_curr.addr & 0xFFF ) == 0 )
	{
		sst25_erase_4k( report_curr.addr );
	}

	report_curr.id++;

	head.mn		= 0x474E5353;
	head.id		= report_curr.id;
	head.len	= len;

	if( gsm_socket[0].state == CONNECTED )  /*当前在线，保存并直接上报*/
	{
		head.attr = ATTR_ONNET_NOREPORT;
		jt808_add_tx( 1, SINGLE_FIRST, 0x0200, -1, jt808_report_timeout, jt808_report_response, len, pinfo, (void*)report_curr.addr );
	}else /*是需要补报的信息*/
	{
		head.attr = ATTR_NONET_NOREPORT;
		report_count++;                     /*增加未上报记录数*/
		if( report_count == 1 )             /*要找到最小的*/
		{
			report_get_addr = report_curr.addr;
		}
		report_curr.len = len;
	}

	sst25_write_through( report_curr.addr, (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
	sst25_write_through( report_curr.addr + 12, pinfo, len );

	rt_sem_release( &sem_dataflash );
	//rt_kprintf( "\n%d>(%d)写入位置:%x id=%d", rt_tick_get( ), report_count, report_curr.addr, report_curr.id );
}

/*
   补报数据更新原先的并读取新纪录
   每次收到中心应答后调用
   每次重新拨号成功后都要从新确认一下
   区分首次读还是上报中的读记录

   使用0704上报，要拼包
 */
void jt808_report_get( void )
{
	GPS_REPORT_HEAD head;
	uint8_t			buf[1024];              /*单包上报的字节不大于256*/
	uint32_t		i;
	uint32_t		addr;
	uint16_t		get_size;               /*获取记录的大小*/
	uint16_t		pos;
	uint8_t			read_count;             /*要读取的记录数*/
	if( report_count == 0 )                 /*没有有未上报记录*/
	{
		return;
	}

	if( gsm_socket[0].state != CONNECTED )  /*不在线*/
	{
		return;
	}

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 5 );

/*批量查找记录*/
	addr				= report_get_addr;
	report_get_count	= 0;
	get_size			= 3;
	pos					= 3;                            /*0x0704数据包，开始的偏移*/
	read_count			= report_count;                 /*还没有报的记录总数*/
	if( report_count > 10 )                             /*最多1次上报10条记录 303字节*/
	{
		read_count = 10;
	}
	for( i = 0; i < DF_POSTREPORT_SECTORS * 64; i++ )   /*每记录64字节,每sector(4096Byte)有64记录*/
	{
		sst25_read( addr, (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
		if( head.mn == 0x474E5353 )                     /*有效记录*/
		{
			if( head.attr >= ATTR_ONNET_NOREPORT )      /*还没有发送*/
			{
				buf[pos]		= head.len >> 8;
				buf[pos + 1]	= head.len;
				sst25_read( addr + 12, buf + pos + 2, head.len );
				pos								+= ( head.len + 2 );
				report_addr[report_get_count]	= addr;
				report_get_count++;
				if( report_get_count == read_count ) /*收到指定条数数据*/
				{
					report_get_addr = addr;
					break;
				}
			}
		}
		addr += 64;
		if( addr >= DF_POSTREPORT_END )
		{
			addr = DF_POSTREPORT_START;
		}
	}

	if( report_get_count ) /*得到的记录数*/
	{
		buf[0]	= report_get_count >> 8;
		buf[1]	= report_get_count & 0xff;
		buf[2]	= 1;
		jt808_add_tx( 1, SINGLE_CMD, 0x0704, -1, RT_NULL, jt808_report_response, pos, buf, RT_NULL );
	}else
	{
		report_count = 0; /*没有得到要上报的数据*/
	}

	rt_sem_release( &sem_dataflash );
	//rt_kprintf( "\n%d>(%d)读出位置:%x,记录数:%d,长度:%d", rt_tick_get( ), report_count, report_get_addr, report_get_count, pos );
}

